import ir.deepmine.asr.normalization.WordToNumber;
import org.junit.jupiter.api.Assertions;
import org.junit.jupiter.api.Test;

public class WordToNumberTests {
    String[][] integerNumbers = {
            {"صفر", "۰"},
            {"شش", "۶"},
            {"دویست و سیصد", "۲۰۰ و ۳۰۰"},
            {"سه و پنج اول هستند", "۳ و ۵ اول هستند"},
            {"هفت و سیزده دو عدد فرد هستند", "۷ و ۱۳ ۲ عدد فرد هستند"},
            {"سیزده", "۱۳"},
            {"چهل و سه", "۴۳"},
            {"هشتاد", "۸۰"},
            {"سی و هشت سی و هشت", "۳۸ ۳۸"},
            {"صد و پنجاه و هفت", "۱۵۷"},
            {"قیمت این صد و پنجاه و هفت تومان است", "قیمت این ۱۵۷ تومان است"},
            {"یک صد و پنجاه و هفت", "۱۵۷"},
            {"هفت صد و شصت و نه", "۷۶۹"},
            {"هفت‌صد هفت صد و شصت و نه", "۷۰۰ ۷۶۹"},
            {"هزار و سیصد و نود و هشت", "۱۳۹۸"},
            {"یک هزار و سیصد و نود و هشت", "۱۳۹۸"},
            {"هشت هزار و سیصد و چهل و سه", "۸۳۴۳"},
            {"هشت هزار و هفت صد و چهل و سه", "۸۷۴۳"},
            {"هشت هزار و هفت‌صد و چهل و سه", "۸۷۴۳"},
            {"هفده هزار و سی", "۱۷۰۳۰"},
            {"پنجاه و هفت هزار و هشت‌صد", "۵۷۸۰۰"},
            {"عدد پنجاه و هفت هزار و هشت‌صد متوسط است", "عدد ۵۷۸۰۰ متوسط است"},
            {"پنجاه و هفت هزار و هشت صد", "۵۷۸۰۰"},
            {"صد و سه هزار و پنجاه و چهار", "۱۰۳۰۵۴"},
            {"هشت میلیون و سیصد و هفت هزار و شصت", "۸۳۰۷۰۶۰"},
            {"هفتاد میلیون و چهار صد و هفتاد و پنج هزار و دویست و هشتاد و هفت", "۷۰۴۷۵۲۸۷"},
            {"هفت صد و سی و هشت میلیون و شش صد و بیست و نه هزار و هفت صد و هفتاد و سه", "۷۳۸۶۲۹۷۷۳"},
            {"عدد هفت صد و سی و هشت میلیون و شش صد و بیست و نه هزار و هفت صد و هفتاد و سه بزرگ است", "عدد ۷۳۸۶۲۹۷۷۳ بزرگ است"},
            {"دو دهه هزار و سیصد و پنجاه و هزار و سیصد و هفتاد در تاریخ ایران مهم هستند", "۲ دهه ۱۳۵۰ و ۱۳۷۰ در تاریخ ایران مهم هستند"},
            {"دهه هزار و سیصد و پنجاه و هزار و سیصد و هفتاد دو دهه مهم در تاریخ ایران هستند", "دهه ۱۳۵۰ و ۱۳۷۰ ۲ دهه مهم در تاریخ ایران هستند"},

            {"سیزده میلیارد و چهارصد و سی و چهار میلیون", "۱۳ میلیارد و ۴۳۴ میلیون"},
            {"قیمت این زمین سیزده میلیارد و چهارصد و سی و چهار میلیون تومان است", "قیمت این زمین ۱۳ میلیارد و ۴۳۴ میلیون تومان است"},
            {"شش میلیون و صد هزار", "۶ میلیون و ۱۰۰ هزار"},
            {"سه میلیون و چهل و هفت هزار", "۳ میلیون و ۴۷ هزار"},
    };

    String[][] floatNumbers = {
            {"هیجده ممیز سه دهم", "۱۸٫۳"},
            {"هیجده ممیز سه", "۱۸٫۳"},
            {"هفتاد و پنج ممیز سی و هشت صدم", "۷۵٫۳۸"},
            {"مساحت این زمین هفتاد و پنج ممیز سی و هشت صدم متر مربع است", "مساحت این زمین ۷۵٫۳۸ متر مربع است"},
            {"پنجاه و هفت ممیز ششصد و نوزده هزارم", "۵۷٫۶۱۹"},
            {"هشتاد و هفت ممیز صفر پنجاه", "۸۷٫۰۵۰"},
            {"هشتاد و هفت ممیز پنجاه هزارم", "۸۷٫۰۵۰"},
            {"هشت میلیون و سیصد و هفت هزار و شصت ممیز صفر صفر هفت‌صد و بیست و یک", "۸۳۰۷۰۶۰٫۰۰۷۲۱"},
    };

    String[][] phoneNumbers = {
            {"چهل و پنج دو صفر سیصد و هفتاد یک", "۴۵۲۰۳۷۰۱"},
            {"شماره خانه چهل و پنج دو صفر سه هزار و هفت صد و یک است", "شماره خانه ۴۵۲۰۳۷۰۱ است"},
            {"چهل و پنج صفر صفر سی و هفت صفر یک", "۴۵۰۰۳۷۰۱"},
            {"نود و یک صفر یک سه هزار و یک", "۹۱۰۱۳۰۰۱"},
            {"صفر بیست و یک شصت و شش هشتاد و هفت سی و هفت هفتاد", "۰۲۱۶۶۸۷۳۷۷۰"},
            {"صفر نهصد و یک سیصد چهار هزار و صد", "۰۹۰۱۳۰۰۴۱۰۰"},
            {"شماره اصغر صفر نهصد و یک سیصد چهار هزار و صد است", "شماره اصغر ۰۹۰۱۳۰۰۴۱۰۰ است"},
            {"صفر نهصد و هفده سی‌صد و پنجاه و یک نود و چهار پنجاه و سه", "۰۹۱۷۳۵۱۹۴۵۳"},
            {"شماره موبایل من صفر نهصد و هفده سی‌صد و پنجاه و یک نود و چهار پنجاه و سه است", "شماره موبایل من ۰۹۱۷۳۵۱۹۴۵۳ است"},
    };

    String[][] dateTime = {
            {"هفت هفت یک هزار و سیصد و هفتاد و دو", "۱۳۷۲/۰۷/۰۷"},
            {"هفت هفت هزار و سیصد و هفتاد و دو", "۱۳۷۲/۰۷/۰۷"},
            {"در تاریخ هشت هشت هشتاد و هشت", "در تاریخ ۸۸/۰۸/۰۸"},
            {"هجده و چهل و سه دقیقه", "۱۸:۴۳"},
            {"سه و چهار دقیقه", "۰۳:۰۴"},
            {"بیست و سه دقیقه", "۲۰:۰۳"},
            {"بیست و یک دقیقه", "۲۰:۰۱"},
            {"بیست و هفده دقیقه", "۲۰:۱۷"},
            {"بیست و پنجاه و چهار دقیقه", "۲۰:۵۴"},
            {"بیست و یک و پنجاه و چهار دقیقه", "۲۱:۵۴"},
            {"بیست و سه و چهار دقیقه", "۲۳:۰۴"},
            {"بیست و سه و سی و هفت دقیقه", "۲۳:۳۷"},
    };

    @Test
    void testIntegers() {
        WordToNumber wordToNumber = WordToNumber.getInstance();
        for (String[] testCase : integerNumbers) {
            String outText = wordToNumber.convert(testCase[0], true, false, false);
            Assertions.assertEquals(testCase[1], outText);
        }
    }

    @Test
    void testFloats() {
        WordToNumber wordToNumber = WordToNumber.getInstance();
        for (String[] testCase : floatNumbers) {
            String outText = wordToNumber.convert(testCase[0], true, false, false);
            Assertions.assertEquals(testCase[1], outText);
        }
    }

    @Test
    void testPhones() {
        WordToNumber wordToNumber = WordToNumber.getInstance();
        for (String[] testCase : phoneNumbers) {
            String outText = wordToNumber.convert(testCase[0], false, false, true);
            Assertions.assertEquals(testCase[1], outText);
        }
    }

    @Test
    void testDateTime() {
        WordToNumber wordToNumber = WordToNumber.getInstance();
        for (String[] testCase : dateTime) {
            String outText = wordToNumber.convert(testCase[0], false, true, false);
            Assertions.assertEquals(testCase[1], outText);
        }
    }
}
